void main()
{
  // Operators
  // تقسم إلى علامَاتٍ لتقوم بأمور حسابية لذلك سنبدأ اليوم بالـ Arithmetic Operators
  /*
  /////////////////////////////////
   Arithmetic Operators
   تنقسم إلى الأمور الأتية
  + ِِِAdd
  - subtract
  - reverse sign
  * multiply
  / divide
  ~/ divide return integer result
  % remainder return integer
  ++ increment
  -- decrement
  * */

  int x = 4;
  int y = 7;

  int z = x + y;
  print(z);
  // 11

  z = x - y;
  print(z);
  // -3

  z = x + (-y);
  print(z);
  // -3

  z = x * y;
  print(z);
  // 28

  // z = x / y;
  // لن يقوم بحسابها لأن z تم التعرف عليه على إنَّهُ عدد صحيح ولكِن الـ Compiler قام بحسابِها فوجد أنَّه ذات كسر
  // ولكِن إذا أرد أنْ تقوم بها ويحذف ما بعد العلامة سيكون بالشكل التالي
  z = x ~/ y;
  print(z);
  // 0

  // ولكِن إنْ احبَبت أنْ تقوم بحسابِها بالشكل الدقيق فيجب أنْ تقوم بتغير نوع المتغير
  double a = x / y;
  print(a);
  // 0.5714285714285714

  z = x % y;
  print(z);
  // 4

  z++;
  print(z);
  // 5
  // ما الذي حدث بالأعلى؟! لقد زاد واحد على العدد الأساسي عند z

  z--;
  print(z);
  // 4;
  // ما الذي حدث بالأعلى؟! لقد قلَّ واحد على العدد الأساسي عند z

  // ما الفرق بين z++ و ++z
  // الأولى يزيد ويخرجلَك الناتِج في وقتيها بينَما الثانية تزيد الناتج بعد الطبع


}