void main()
{
  // Bitwise Operators
  // هو يقوم بالتحكم في الـ Binary Code كأرقام أو حروف...إلخ فيقوم بتحولها إلى 0 أو 1

  // Bitwise AND &
  // تُرجع واحدًا في كل موضع بت تكون فيه وحدات البت المقابلة لكلا المعاملين هي الآحاد.

  // Bitwise OR |
  // لعرض واحد في كل موضع بت تكون فيه وحدات البت المقابلة لأي من المعاملين أو كليهما عبارة عن وحدات.

  // Bitwise XOR ^
  // لعرض واحد في كل موضع بت تكون فيه البتات المقابلة لأي من المعاملين وليس كلاهما عبارة عن وحدات.

  // Bitwise NOT ~
  // يقلب بتات المعامل الخاص به.

  // Left shift <<
  // ينقل أ في التمثيل الثنائي ب (<32) بت إلى اليسار ، مع التحول في الأصفار من اليمين.

  // Right shift >>
  // يزيح أ في التمثيل الثنائي ب (<32) بت إلى اليمين ، مع إزاحة البتات.

  int x = 7;
  int y = 10;

  print(x & y);
  // 2

  print(x | y);
  // 15

  print(x ^ y);
  // 13

  print(x << y);
  // 7168

  print(x >> y);
  // 0

  print(~x);
  // -8

}