void main()
{
  // Loops
  // إذا كُنَّا نريد أنْ نطبع مِن 1 إلى 10
  print(1);
  print(2);
  print(3);
  print(4);
  print(5);
  print(6);
  print(7);
  print(8);
  print(9);
  print(10);

  // هل هناك طريقة أقل عدد سطور وأكثر ذكاءً
  // نعم، فمِن الممكن أنْ نستخدم الـ Loops أو الحلقات
  // كيف تتكون الـ Loops
  // For
  // أولًا بنعرف الـ for ومِن ثمَّ نفتح قوسين وباخلهم ثلاثة أمور
  // أولًا:
  // نضع المتغير
  // القاعدة
  // الزيادة أو النقصان
  // الكود

  for ( var i=1; i<=10; i++) {
    print(i);
    // 1
    // 2
    // 3
    // 4
    // 5
    // 6
    // 7
    // 8
    // 9
    // 10
  }
}